package BoSeok.Week8;

public class LG1 {
    public static void main(String[] args) {

    }

}

/*

이름 사전순서대로 정렬,
이름 같으면 전화번호 별로 정렬

input
10
jpa 010-1111-2222
abc 010-7777-2222
bbc 010-7778-2222
abb 010-4332-4732
abc 010-0778-3222
jpa 010-0111-2222
jpa 010-0111-1222
js 010-4672-3284
jsa 010-3627-3481
jpa 010-1234-7723

정답
[abb, 010-4332-4732]
[abc, 010–0778-3222]
[abc, 010–7777-2222]
[bbc, 010–7778-2222]
[jpa, 010–0111-1222]
[jpa, 010–0111-2222]
[jpa, 010-1111-2222]
[jpa, 010-1234-7723]
[js, 010-4672-3284]
[jsa, 010-3627-3481]
*/
